app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."price" ASC
---
  def index
    @todos = Product.order :price

INSERT INTO "products" ("name", "description", "quantity", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "helicoptero"], ["description", "um helicoptero maneiro"], ["quantity", 4], ["price", 48.0], ["created_at", "2023-01-19 23:48:37.832078"], ["updated_at", "2023-01-19 23:48:37.832078"]]
---
  def create
    value = params.require(:product).permit :name, :price, :description, :quantity
    # o permit! é inseguro assim acima eu delimito o que pode ser enviado pro meu banco
    # :  simbolo permit> permite os paremetros ! todos
    name = params["name"]
    description = params["description"]
    quantity = params["quantity"]
    price = params["price"]
    product = Product.create value